#### ConnectionInputPoint Members

---

|  |
| --- |
| ConnectionInputPoint Class   Constructors   Methods   Properties   See Also |

The  ConnectionInputPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ConnectionInputPoint | Construct a default input point. |
| Public method | ConnectionInputPoint(XYZ) | Construct an input point from 3d point. A new valid id will be auto-generated. |
| Public method | ConnectionInputPoint(XYZ, Guid) | Construct an input point from 3d point and id. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ConnectionInputPoint |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Id | Unique id of this input point. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Point | 3d position of this input point. |

# See Also

ConnectionInputPoint Class

Autodesk.Revit.DB.Structure Namespace